test/upward_seepage/mix_FD/CFD/system/decomposeParDict
/*-------------------------------*- C++ -*---------------------------------*\
|    =========                                                              |
|    \\      /     OpenFOAM                                                 |
|     \\    /                                                               |
|      \\  /       The Open Source CFD Toolbox                              |
|       \\/                                        http://www.OpenFOAM.org  |
\*-------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  note        "mesh decomposition control dictionary";
  location    "system";
  object      decomposeParDict;
}

numberOfSubdomains  8;

method        simple;

simpleCoeffs
{
  n           (2 2 2);
  delta       0.001;
}
